Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СинхронизироватьДокументыOnline(Команда)
	ДесериализацияПрикладныхТиповНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДесериализацияПрикладныхТиповНаСервере()
	
	// Создать объект чтения и открыть файл, из которого будет выполняться чтение.
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл("http://o-doc.info/api/Document/?format=json");
	// Выполнить чтение данных в соответствие Данные с помощью объекта чтения (Чтение).
	Данные = ПрочитатьJSON(Чтение, Истина, "Document_date", ФорматДатыJSON.ISO);
	// Данные = ПрочитатьJSON(Чтение);
	
	// Завершить работу с файлом.
	Чтение.Закрыть();
		
	// Таблица документов
	тзДокументы = Новый ТаблицаЗначений;
	тзДокументы.Колонки.Добавить("Дата");
	тзДокументы.Колонки.Добавить("Номер");
	тзДокументы.Колонки.Добавить("Автор");
	тзДокументы.Колонки.Добавить("Комментарий");
	тзДокументы.Колонки.Добавить("ТЧ");
	
	// Табличная часть документа
	тзТЧ = Новый ТаблицаЗначений;
	тзТЧ.Колонки.Добавить("Номенклатура");
	тзТЧ.Колонки.Добавить("Количество");
	тзТЧ.Колонки.Добавить("Цена");
	тзТЧ.Колонки.Добавить("Стоимость");	
	
	// Длина номера документа
	ДлинаНомера = Метаданные.Документы.ПриходнаяНакладная.ДлинаНомера;
	
	Для Каждого Документ Из Данные Цикл	
		Если Документ["Document_viewmovement"] = Метаданные.Документы.ПриходнаяНакладная.Синоним Тогда	
			СтрокаТЗДокументы = тзДокументы.Добавить();
			СтрокаТЗДокументы.Дата = Документ["Document_date"];
			СтрокаТЗДокументы.Номер = Формат(Число(Документ["Document_number"]), "ЧЦ="+ДлинаНомера+"; ЧВН=; ЧГ=0");
			СтрокаТЗДокументы.Автор = Документ["Document_author"];
			СтрокаТЗДокументы.Комментарий = Документ["Document_comment"];
			
			мзТабличныхЧастей = Документ["tableproducts_set"];
			
			Для каждого СтрокаТовары Из мзТабличныхЧастей Цикл
				СтрокаТЧТовары = тзТЧ.Добавить();
				
				НоменклатураТЧ = НайтиНоменклатуруТЧ(СтрокаТовары["TableProducts_nomenclature"]);
				
				Если ТипЗнч(НоменклатураТЧ) = Тип("СправочникСсылка.Номенклатура") Тогда
					СтрокаТЧТовары.Номенклатура = НоменклатураТЧ;
				Иначе
					обНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
					обНоменклатура.Наименование = НоменклатураТЧ;	
					обНоменклатура.Записать();
					СтрокаТЧТовары.Номенклатура = обНоменклатура.Ссылка;
				КонецЕсли;
				СтрокаТЧТовары.Количество = Число(СтрокаТовары["TableProducts_quantity"]);
				СтрокаТЧТовары.Цена = Число(СтрокаТовары["TableProducts_price"]);
				СтрокаТЧТовары.Стоимость = Число(СтрокаТовары["TableProducts_sum"]);
			КонецЦикла;
			СтрокаТЗДокументы.ТЧ = тзТЧ;
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ПриходнаяНакладная.ВерсияДанных КАК ВерсияДанных,
	|	ПриходнаяНакладная.ПометкаУдаления КАК ПометкаУдаления,
	|	ПриходнаяНакладная.Номер КАК Номер,
	|	ПриходнаяНакладная.Дата КАК Дата,
	|	ПриходнаяНакладная.Проведен КАК Проведен,
	|	ПриходнаяНакладная.Автор КАК Автор,
	|	ПриходнаяНакладная.Комментарий КАК Комментарий,
	|	ПриходнаяНакладная.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Стоимость КАК Стоимость
	|	) КАК Товары
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Номер В(&мНомера)";
	
	Запрос.УстановитьПараметр("мНомера", тзДокументы.ВыгрузитьКолонку("Номер"));
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	мНомеровДокументовСуществующих = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЗДокументов = тзДокументы.Найти(ВыборкаДетальныеЗаписи.Номер, "Номер");
		обДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		// Обновление даты
		обДок.Дата = СтрокаТЗДокументов.Дата;
		
		// Обновление автора документа
		АвторДокумента = НайтиАвтораДокумента(СтрокаТЗДокументов.Автор);
		Если ТипЗнч(АвторДокумента) = Тип("СправочникСсылка.Сотрудники") Тогда
			обДок.Автор = АвторДокумента;
		Иначе
			обСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
			обСотрудник.Наименование = АвторДокумента;	
			обСотрудник.Записать();
			обДок.Автор = обСотрудник.Ссылка;
		КонецЕсли; 
		
		// Обновление комментария
		обДок.Комментарий = СтрокаТЗДокументов.Комментарий;
		
		// Обновление табличной части
		Для каждого СтрокаТовар Из СтрокаТЗДокументов.ТЧ Цикл
			СтрокаВДокументе = обДок.Товары.Найти(СтрокаТовар.Номенклатура, "Номенклатура");
			Если ЗначениеЗаполнено(СтрокаВДокументе) Тогда
				СтрокаВДокументе.Количество = СтрокаТовар.Количество;
				СтрокаВДокументе.Стоимость = СтрокаТовар.Стоимость;			
				СтрокаВДокументе.Цена = СтрокаТовар.Цена;
			Иначе
				НоваяСтрокаВДокументе = обДок.Товары.Добавить();
				НоваяСтрокаВДокументе.Номенклатура = СтрокаТовар.Номенклатура;
				НоваяСтрокаВДокументе.Количество = СтрокаТовар.Количество;
				НоваяСтрокаВДокументе.Стоимость = СтрокаТовар.Стоимость;			
				НоваяСтрокаВДокументе.Цена = СтрокаТовар.Цена;
			КонецЕсли;	
		КонецЦикла;	
		
		обДок.Записать();
	КонецЦикла;		
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиАвтораДокумента(Знач Автор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Автор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Автор = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Автор;
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуруТЧ(Знач Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Номенклатура;
КонецФункции
